OversetTestCase/TestCase1/Main/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "5e-05/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

20
(
    back
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          29234;
        startFace       1048507;
    }
    Surface
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          0;
        startFace       1077741;
    }
    workpiece
    {
        type            wall;
        physicalType    patch;
        inGroups        1(wall);
        nFaces          1596;
        startFace       1077741;
    }
    tool
    {
        type            wall;
        physicalType    patch;
        inGroups        1(wall);
        nFaces          234;
        startFace       1079337;
    }
    wall
    {
        type            wall;
        physicalType    patch;
        inGroups        1(wall);
        nFaces          1066;
        startFace       1079571;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          78;
        startFace       1080637;
    }
    outlet
    {
        type            wall;
        physicalType    patch;
        inGroups        1(wall);
        nFaces          169;
        startFace       1080715;
    }
    front
    {
        type            wall;
        physicalType    patch;
        inGroups        1(wall);
        nFaces          29234;
        startFace       1080884;
    }
    outlet_side_1
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          0;
        startFace       1110118;
    }
    outlet_side_2
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          0;
        startFace       1110118;
    }
    outlet_side_3
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          0;
        startFace       1110118;
    }
    outlet_side_4
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          0;
        startFace       1110118;
    }
    outlet_side_5
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          0;
        startFace       1110118;
    }
    outlet_side_6
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          0;
        startFace       1110118;
    }
    outlet_side_7
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          0;
        startFace       1110118;
    }
    outlet_side_8
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          0;
        startFace       1110118;
    }
    outlet_empty
    {
        type            slip;
        physicalType    patch;
        inGroups        1(slip);
        nFaces          3111;
        startFace       1110118;
    }
    outlet_wall
    {
        type            slip;
        physicalType    patch;
        inGroups        1(slip);
        nFaces          2023;
        startFace       1113229;
    }
    outlet_ext
    {
        type            patch;
        physicalType    patch;
        nFaces          952;
        startFace       1115252;
    }
    Overset
    {
        type            overset;
        physicalType    patch;
        nFaces          6708;
        startFace       1116204;
    }
)

// ************************************************************************* //
